interface stockInfoData {
  companyId: number;
  code: string;
  korName: string;
}
const stockInfoData = () => [
  {
    companyId: 1,
    code: "코스피 005930",
    korName: "삼성전자",
    companyInfo:
      "삼성전자는 1969년 설립된 기업으로 반도체 , 전자제품 제조 판매업을 영위하고 있다. 주요종속 기업은 삼성전자 로지텍, 삼성전자 서비스, 삼성디스플레이 ,스테코 ,삼성 메디슨 등이 있다, 주요 매출은 스마트폰, 네트워크시스템 ,컴퓨터 등을 생산하는 IM부문에서 발생하고 있으며 반데체 CE 부문이 뒤를 잇고 있다  ",
  },
  {
    companyId: 2,
    code: "코스피 005490",
    korName: "POSCO홀딩스",
    companyInfo:
      "삼성전자는 1969년 설립된 기업으로 반도체 , 전자제품 제조 판매업을 영위하고 있다. 주요종속 기업은 삼성전자 로지텍, 삼성전자 서비스, 삼성디스플레이 ,스테코 ,삼성 메디슨 등이 있다, 주요 매출은 스마트폰, 네트워크시스템 ,컴퓨터 등을 생산하는 IM부문에서 발생하고 있으며 반데체 CE 부문이 뒤를 잇고 있다  ",
  },
  {
    companyId: 3,
    code: "코스피 068270",
    korName: "셀트리온",
    companyInfo:
      "삼성전자는 1969년 설립된 기업으로 반도체 , 전자제품 제조 판매업을 영위하고 있다. 주요종속 기업은 삼성전자 로지텍, 삼성전자 서비스, 삼성디스플레이 ,스테코 ,삼성 메디슨 등이 있다, 주요 매출은 스마트폰, 네트워크시스템 ,컴퓨터 등을 생산하는 IM부문에서 발생하고 있으며 반데체 CE 부문이 뒤를 잇고 있다  ",
  },
  {
    companyId: 4,
    code: "코스피 086520",
    korName: "에코프로",
    companyInfo:
      "삼성전자는 1969년 설립된 기업으로 반도체 , 전자제품 제조 판매업을 영위하고 있다. 주요종속 기업은 삼성전자 로지텍, 삼성전자 서비스, 삼성디스플레이 ,스테코 ,삼성 메디슨 등이 있다, 주요 매출은 스마트폰, 네트워크시스템 ,컴퓨터 등을 생산하는 IM부문에서 발생하고 있으며 반데체 CE 부문이 뒤를 잇고 있다  ",
  },
  {
    companyId: 5,
    code: "코스피 247540",
    korName: "에코프로비엠",
    companyInfo:
      "삼성전자는 1969년 설립된 기업으로 반도체 , 전자제품 제조 판매업을 영위하고 있다. 주요종속 기업은 삼성전자 로지텍, 삼성전자 서비스, 삼성디스플레이 ,스테코 ,삼성 메디슨 등이 있다, 주요 매출은 스마트폰, 네트워크시스템 ,컴퓨터 등을 생산하는 IM부문에서 발생하고 있으며 반데체 CE 부문이 뒤를 잇고 있다  ",
  },
  {
    companyId: 6,
    code: "코스피 013570",
    korName: "디와이",
    companyInfo:
      "삼성전자는 1969년 설립된 기업으로 반도체 , 전자제품 제조 판매업을 영위하고 있다. 주요종속 기업은 삼성전자 로지텍, 삼성전자 서비스, 삼성디스플레이 ,스테코 ,삼성 메디슨 등이 있다, 주요 매출은 스마트폰, 네트워크시스템 ,컴퓨터 등을 생산하는 IM부문에서 발생하고 있으며 반데체 CE 부문이 뒤를 잇고 있다  ",
  },
  {
    companyId: 7,
    code: "코스피 192400",
    korName: "쿠쿠홀딩스",
    companyInfo:
      "삼성전자는 1969년 설립된 기업으로 반도체 , 전자제품 제조 판매업을 영위하고 있다. 주요종속 기업은 삼성전자 로지텍, 삼성전자 서비스, 삼성디스플레이 ,스테코 ,삼성 메디슨 등이 있다, 주요 매출은 스마트폰, 네트워크시스템 ,컴퓨터 등을 생산하는 IM부문에서 발생하고 있으며 반데체 CE 부문이 뒤를 잇고 있다  ",
  },
  {
    companyId: 8,
    code: "코스피 323410",
    korName: "카카오뱅크",
    companyInfo:
      "삼성전자는 1969년 설립된 기업으로 반도체 , 전자제품 제조 판매업을 영위하고 있다. 주요종속 기업은 삼성전자 로지텍, 삼성전자 서비스, 삼성디스플레이 ,스테코 ,삼성 메디슨 등이 있다, 주요 매출은 스마트폰, 네트워크시스템 ,컴퓨터 등을 생산하는 IM부문에서 발생하고 있으며 반데체 CE 부문이 뒤를 잇고 있다  ",
  },
  {
    companyId: 9,
    code: "코스피 069640",
    korName: "한세엠케이",
    companyInfo:
      "삼성전자는 1969년 설립된 기업으로 반도체 , 전자제품 제조 판매업을 영위하고 있다. 주요종속 기업은 삼성전자 로지텍, 삼성전자 서비스, 삼성디스플레이 ,스테코 ,삼성 메디슨 등이 있다, 주요 매출은 스마트폰, 네트워크시스템 ,컴퓨터 등을 생산하는 IM부문에서 발생하고 있으며 반데체 CE 부문이 뒤를 잇고 있다  ",
  },
  {
    companyId: 10,
    code: "코스피 001390",
    korName: "KG케미칼",
    companyInfo:
      "삼성전자는 1969년 설립된 기업으로 반도체 , 전자제품 제조 판매업을 영위하고 있다. 주요종속 기업은 삼성전자 로지텍, 삼성전자 서비스, 삼성디스플레이 ,스테코 ,삼성 메디슨 등이 있다, 주요 매출은 스마트폰, 네트워크시스템 ,컴퓨터 등을 생산하는 IM부문에서 발생하고 있으며 반데체 CE 부문이 뒤를 잇고 있다  ",
  },
  {
    companyId: 11,
    code: "코스피 051910",
    korName: "LG화학",
    companyInfo:
      "삼성전자는 1969년 설립된 기업으로 반도체 , 전자제품 제조 판매업을 영위하고 있다. 주요종속 기업은 삼성전자 로지텍, 삼성전자 서비스, 삼성디스플레이 ,스테코 ,삼성 메디슨 등이 있다, 주요 매출은 스마트폰, 네트워크시스템 ,컴퓨터 등을 생산하는 IM부문에서 발생하고 있으며 반데체 CE 부문이 뒤를 잇고 있다  ",
  },
  {
    companyId: 12,
    code: "코스피 005380",
    korName: "현대차",
    companyInfo:
      "삼성전자는 1969년 설립된 기업으로 반도체 , 전자제품 제조 판매업을 영위하고 있다. 주요종속 기업은 삼성전자 로지텍, 삼성전자 서비스, 삼성디스플레이 ,스테코 ,삼성 메디슨 등이 있다, 주요 매출은 스마트폰, 네트워크시스템 ,컴퓨터 등을 생산하는 IM부문에서 발생하고 있으며 반데체 CE 부문이 뒤를 잇고 있다  ",
  },
  {
    companyId: 13,
    code: "코스피 066570",
    korName: "LG전자",
    companyInfo:
      "삼성전자는 1969년 설립된 기업으로 반도체 , 전자제품 제조 판매업을 영위하고 있다. 주요종속 기업은 삼성전자 로지텍, 삼성전자 서비스, 삼성디스플레이 ,스테코 ,삼성 메디슨 등이 있다, 주요 매출은 스마트폰, 네트워크시스템 ,컴퓨터 등을 생산하는 IM부문에서 발생하고 있으며 반데체 CE 부문이 뒤를 잇고 있다  ",
  },
  {
    companyId: 14,
    code: "코스피 000270",
    korName: "기아",
    companyInfo:
      "삼성전자는 1969년 설립된 기업으로 반도체 , 전자제품 제조 판매업을 영위하고 있다. 주요종속 기업은 삼성전자 로지텍, 삼성전자 서비스, 삼성디스플레이 ,스테코 ,삼성 메디슨 등이 있다, 주요 매출은 스마트폰, 네트워크시스템 ,컴퓨터 등을 생산하는 IM부문에서 발생하고 있으며 반데체 CE 부문이 뒤를 잇고 있다  ",
  },
];

export default stockInfoData;
